Revit 2027 API
AnalysisDisplayDiagramSettings.Transparency Property
 Transparency percentage of diagram color fill
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Transparency { get; set; }
Public Property Transparency As Integer
	Get
	Set
public:
property int Transparency {
	int get ();
	void set (int value);
}
member Transparency : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentsInconsistentException |  When setting this property: transparency is less than 0 or greater than 100
See Also
Reference
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace